In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_excel('Alldata.xlsx')
data.head()

,Address,City,Lot Size,Listing Price,Square Feet,Baths,Beds,Square Feet.1,Year Built,$/Square Feet
0,8485 133rd St W,Apple Valley,135166.0,380000,NaN,4.0,4,NaN,1978.0,81.0
1,13637 Duluth Cir,Apple Valley,94873.0,825000,5200.0,4.0,5,5200.0,1987.0,159.0
2,8477 133rd St Ct,Apple Valley,82086.0,585000,5055.0,4.0,5,5055.0,1977.0,116.0
3,5260 132nd St W,Apple Valley,69260.0,689000,NaN,4.0,4,NaN,1960.0,114.0
4,12790 Dory Ave,Apple Valley,57194.0,425000,3480.0,3.0,3,3480.0,1972.0,122.0

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199 entries, 0 to 198
Data columns (total 10 columns):
Address          199 non-null object
City             199 non-null object
Lot Size         199 non-null float64
Listing Price    199 non-null int64
Square Feet      82 non-null float64
Baths            199 non-null float64
Beds             199 non-null int64
Square Feet.1    82 non-null float64
Year Built       198 non-null float64
$/Square Feet    197 non-null float64
dtypes: float64(6), int64(2), object(2)
memory usage: 15.6+ KB

In [5]:
data.columns

Index(['Address', 'City', 'Lot Size', 'Listing Price', 'Square Feet', 'Baths',
       'Beds', 'Square Feet.1', 'Year Built', '$/Square Feet'],
      dtype='object')

In [3]:
data.describe()

,Lot Size,Listing Price,Square Feet,Baths,Beds,Square Feet.1,Year Built,$/Square Feet
count,199.000000,199.000000,82.000000,199.000000,199.000000,82.000000,198.000000,197.000000
mean,16188.766332,357048.085427,2837.634146,2.891960,3.949749,2837.634146,1988.848485,136.167513
std,13846.380868,103910.811190,887.601478,0.890259,0.827243,887.601478,16.366900,23.243550
min,2918.000000,130000.000000,1260.000000,1.000000,2.000000,1260.000000,1960.000000,58.000000
25%,11064.000000,278000.000000,2095.500000,2.000000,3.000000,2095.500000,1977.000000,118.000000
50%,13068.000000,338730.000000,2764.000000,3.000000,4.000000,2764.000000,1986.500000,135.000000
75%,16552.000000,425000.000000,3337.250000,4.000000,4.500000,3337.250000,1998.000000,152.000000
max,135166.000000,825000.000000,5423.000000,6.000000,6.000000,5423.000000,2018.000000,205.000000

## Dropping unwanted columns

In [6]:
data = data.drop(columns = ['Address', 'Square Feet','Square Feet.1', '$/Square Feet'])
data.shape

(199, 6)

In [7]:
data.head()

           City  Lot Size  Listing Price  Baths  Beds  Year Built
0  Apple Valley  135166.0         380000    4.0     4      1978.0
1  Apple Valley   94873.0         825000    4.0     5      1987.0
2  Apple Valley   82086.0         585000    4.0     5      1977.0
3  Apple Valley   69260.0         689000    4.0     4      1960.0
4  Apple Valley   57194.0         425000    3.0     3      1972.0

In [8]:
#Missing records 
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 199 entries, 0 to 198
Data columns (total 6 columns):
City             199 non-null object
Lot Size         199 non-null float64
Listing Price    199 non-null int64
Baths            199 non-null float64
Beds             199 non-null int64
Year Built       198 non-null float64
dtypes: float64(3), int64(2), object(1)
memory usage: 9.4+ KB

In [10]:
data[data['Year Built'].isnull()]

             City  Lot Size  Listing Price  Baths  Beds  Year Built
102  Apple Valley   12893.0         369630    3.0     4         NaN

In [13]:
# drop rwo at index 102
data = data.drop(102)
data.shape

(198, 6)

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 198 entries, 0 to 198
Data columns (total 6 columns):
City             198 non-null object
Lot Size         198 non-null float64
Listing Price    198 non-null int64
Baths            198 non-null float64
Beds             198 non-null int64
Year Built       198 non-null float64
dtypes: float64(3), int64(2), object(1)
memory usage: 10.8+ KB

In [15]:
data.to_csv('appleData1.csv') # create a csv file from the clean data